bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
dbaeumer.vscode-eslint
esbenp.prettier-vscode
fill-labs.dependi
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
jnoortheen.nix-ide
ms-azuretools.vscode-containers
ms-ossdata.vscode-pgsql
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
openai.chatgpt
oven.bun-vscode
redhat.vscode-yaml
sonarsource.sonarlint-vscode
sourcegraph.sourcegraph
svelte.svelte-vscode
tamasfe.even-better-toml
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
